[
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "ISSS608 Visual Analytics and Applications: DataViz Makeover",
    "author": [
      {
        "name": "Desmond Lim",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1. Critiques and Suggestions on Current Visualisation\r\nClarity\r\nCritique\r\nSuggestions\r\n1) Information in the lead-in paragraph could not be visualized/interpreted from the chart. For example, it stated the share of labour force aged 25 to 54 declined from 75% to 67%. That could not be interpreted from the chart, as the population are grouped in 5-year brackets.\r\nThe dashboard title and lead-in to be able to relate and provide an intuitive understanding to the chart visualisation.\r\n2) The visualisation only depicts the comparison statistics from 2009 and 2019. It lacks the information on the changes between 2009 and 2019.\r\nThe chart visualisation will incorporate the data from 2009 to 2019 to gain more insights to the change in resident labour population over the years.\r\n3) It is not clear whether x-axis labels i.e. 15-19,is categorical or continuous. There is no x-axis title to explain the axis value. Lack of a y-axis and gridlines to provide a gauge for the values.\r\nTo ensure accurate x and y-axis labels with axis title to describe the axis.\r\n4) The median age reference lines used might not be accurately reflecting the chart as the x-axis of “40-44” might be a categorical data.\r\nTo use other statistical values to provide insights to the labour force participation.\r\nAesthetics\r\nCritique\r\nSuggestions\r\n1) The x-axis labels are not aligned to the tick marks but in between the tick marks.\r\nIncorporate proper axis labelling and aligning.\r\n2) Poor colour coding. The colour of the “June 2009” line is too close to the background colour.\r\nProper colour but non-excessive colour coding to highlight necessary information.\r\n3) Poor spacing between the chart axis and the table.\r\nInstead of using a table, proper axis will be in place to show the values in the visualisation\r\n2. Proposed Visualisation Design\r\n Using the above alternative visualisation, it retains the intent of the lead in paragraph which is to be able to compare the labour force participation rate directly with actual resident population in the workforce through a dual axis visualisation.\r\nIt also follows the re-grouping of the age groups into in the lead-in paragraph by classifying into 3 groups “Age 15-24”, “Age 25-54” and “Age 55 & over”.\r\n3. Tableau Visualisation Steps\r\nData Preparation in Excel\r\nS/N\r\nArea\r\nAction\r\n1\r\nRemove irrelevant data\r\nRemoved one row of data under “Total” from excel data file “mrsd_2019LabourForce_T7”.\r\n2\r\nExtract relevant data\r\nExtracted fives rows of data under “15 -24”, “25 -54”, “55 -65” and “65 & over” from excel data file “mrsd_2019LabourForce_T5”.\r\nChart Preparation in Tableau\r\nS/N\r\nArea\r\nAction\r\n1\r\nImport data (Excel) into Tableau\r\n- Connection was created with “mrsd_2019LabourForce_T7”. - Using sheets “T7_T” from the data, a column containing “null” values was hidden. - The columns for the individual years, were highlighted and pivoted to transpose the data.  - The new column was renamed and data type changed from “String” to “Year”.  - “Age (Years)” renamed to “Age Group (Years)”  - Another data source “mrsd_2019LabourForce_T5” was added.  - Same steps were taken to transpose the “Year” columns and to change data type.\r\n2\r\nGrouping the Age Groups\r\n- In Sheet 1, the “Age Group (Years)” table is further grouped through the “Create”, “Group” function as shown. - The “Age Group” was further grouped into 4 main groups namely “15 -24”, “25 -54”, “55 -65” and “65 & over”.  - Creating a new Table “Age Group (Years) II”.\r\n3\r\nCreating first chart\r\n- The first chart shows the resident labour force in each of the age group. - The “Year” measure was dragged to column and the “Population” measure was dragged to Rows. The mark was change to “Line”. - To view the labour participation rate, “Quick Table Calculation” was used to calculate “Percent of Total” and computed using “Table (down)”.- “Sum(Population)” was Ctrl+ Drag to Label. “Line Ends” option was selected.- The y-axis was renamed to “Labour Force by Age Group”  - “Sheet 1” was renamed as “Workforce”.\r\n4\r\nCreating second chart\r\n- The first chart shows the resident labour force participation rate in each of the age group. - A new calculation field “LFPR%” was created with the formula “[LFPR]/100”. This is in order to display the data in percentage format. - The “Year” measure was dragged to column and the “LFPR%” measure was dragged to Rows. - “LFPR%” was dragged to Label. “Line Ends” option was selected. - The y-axis was renamed to “Labour Force Participation Rate”. Y-axis formatted to show percentage. - “Sheet 2” was renamed as “LFPR”.\r\n5\r\nCreating of dashboard And formatting\r\n- Drag “Workforce” and “LFPR” sheet into dashboard. - Drag Text bar to create dashboard title and data source. - Axis of both charts were edited for them to align.\r\n4. Final Visualisation\r\n\r\n5. Insights\r\nThe labour force participation rate for the elderly (55 years old and above) has increased significantly over the years. From 2009 to 2019, the LFPR for the 55 to 64 age group increased from 60.65 to 69.9% and 17.2% to 28.7% for the 64 and above age group. Correspondent changes were seen in the elderly proportion in the labour force with an increase in about 5% for the 55 to 64 age group and about 4% in the 65 and above age group.\r\n\r\nAlthough the labour force participation rate for the main workforce (25-54 years) has increased to 88.3% in 2019 from 84.5% in 2009. A significant drop was seen in the age group’s proportion in the labour force from 75.35% to 67.44%. This was due to the aging of the main force and transitioning into the elderly work force (55 and over) over the past 10 years.\r\n 3. The proportion of the youth (15-24 years) in the labour force is stable with a drop of about 1% from 8.97% (Year 2009) to 7.95% (Year 2019). However, there is an increase of labour force participation rate from 35.6% to 38.3%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-27T23:36:20+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Desmond Lim",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-06T18:42:12+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Idea",
    "description": "Welcome to our new blog, Idea. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Dasimon Lim",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:52+08:00",
    "input_file": {}
  }
]
