[
  {
    "path": "posts/2021-03-21-dataviz-makeover-3/",
    "title": "Dataviz Makeover 3",
    "description": "ISSS608 Visual Analytics and Applications: DataViz Makeover",
    "author": [
      {
        "name": "Desmond Lim",
        "url": {}
      }
    ],
    "date": "2021-03-21",
    "categories": [],
    "contents": "\r\n1. Original Visualisation\r\n\r\n2. Critiques and Suggestions on Original Visualization\r\n2.1 Clarity\r\nCritique\r\nSuggestions\r\nThe visualization is unable to provide further clarity/breakdown on the type of sub-events that occur.\r\nTo include variable information in charts and tooltips.\r\nThe event location dots overlap each other when all the events are chosen. i.e. the Battles (blue) event will cover any others below. Thus unable to visualise the actual events happening in the area.\r\nTo consolidate events into state level events for better visualization and less cluster on map.\r\nUnable to know which state/area the event has happened in. Only the latitude and longitude are shown in tool tip.\r\nTo include necessary variable information in charts and tooltips.\r\n2.2 Aesthetics\r\nCritique\r\nSuggestions\r\nThe y-axis of the line chart which stated “Count of Sheet1” is not properly titled.\r\nTo provide appropriate title to the axis to explain the chart.\r\nThe color scheme used for the difference event type is not optimal. i.e. Riots and strategic developments color shade is very close.\r\nTo ensure color theme used is visible and able to be easily differentiated.\r\nThe event location dots are cluttered covering the country names. No way of seeing which dots are on which country other than via the country filter.\r\nTo consolidate events into state level events for better visualisation and less clustered on map.\r\n2.3 Interactivity\r\nCritique\r\nSuggestions\r\nCountry filtering is done through a typical map filter function on the dashboard.\r\nTo use dashboard actions to allow interactive filtering of countries.\r\nThere is no way of comparing event changes for a certain reference year through the event type chart.\r\nTo create reference year choosing function directly on the chart to allow comparison between multiple reference years.\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\n\r\n3.2 Advantages of New Visualisation\r\nThe new visualisation will be able to provide a better general overview of the conflict event situation in South East Asia through the choropleth map. Detailed information on events that occurred in each state will also be shown. By clicking on the country name on the dashboard, the specific country will be chosen and charts will change according to the chosen country, allowing more insights to be obtained. The two charts will be able to provide information not available in the original visualisation.\r\nInteractivity wise, the percentage change of events over the time period can be shown with a reference year which can be chosen by clicking any data point for that year in the chart. Changing the reference year will at the same time change the year parameter of the map, switching it to the reference year. The top 5 sub events that occurred in each country can also be shown in the charts provide details on the fatalities that occurred in those events.\r\n4. Data Visualisation Steps\r\n4.1 Data Source\r\nThe data used was obtained from the Armed Conflict Location & Event Data Project (ACLED). The datafiles contain dates, actors, locations, fatalities, and types of all reported political violence and protest events across Southeast Asia.\r\n4.2 Data Preparation in Tableau\r\nThe data set “Southeast-Asia_2010-2020_Oct31” was dragged into Tableau and fields were checked for discrepancy.\r\nThe unrelated fields are selected and hidden. \r\nThe variable “Admin1” was renamed as “State” and changed its geographic role to “State/Province” as shown. \r\n4.3 Geographic Map\r\nA calculated field called “Number of Events” is created as shown. \r\nThe “Longitude” measure was dragged to column and “Latitude” measure to rows \r\nThe “Country” measure was dragged to Detail card and “Number of Events” was dragged to the Color card. \r\nTo create another map layer above the current choropleth map, the “State” measure is dragged onto the map as shown. \r\nThe “State” measure is dragged to the Detail card, and the “Number of Events” to the Size card. This is to consolidate the number of events happening at a state level. \r\nThe color, size and opacity of the circle is adjusted.\r\nFor the “Country” layer, “State” measure was dragged into tooltip and changed to count distinct. \r\nThe tooltip was edited as shown.\r\nFor the “State” layer, “Country” measure, “Admin3” measure, “Event Interactions and fatalities” sheet and sheet were inserted into the tooltip. \r\nA calculated field “Year Filter” is created and dragged to filter card. \r\nStandardized font to Tableau Book and font color of axis.\r\n4.4 Event Interactions and fatalities Sub Chart\r\nA new calculated field called “Type of Interaction” is created to differentiate whether the event occurred only has one party or two parties. \r\n“Type of Interaction”, “Event Type” and “Sub Event Type” were dragged to rows. \r\n“Sub Event Type” was also dragged to Filters card, to show the Top 5 records. \r\n“Fatalities” and “Number of Events” measure is dragged to Text with the mark card. \r\nStandardize font to Tableau Book and font color of axis.\r\n4.5 Fatalities By Year\r\nThe “Year” measure was dragged to columns and “Fatalities” to rows. \r\n“Sub Event Type” and “Country Filter” were dragged to Filters card, to show the Top 5 records and also dragged to color. \r\nAnother “Fatalities” measure was dragged to rows to create a dual axis chart. The second chart is changed to a “circle” type under the mark card. The axis is also synchronized.\r\n\r\nA reference line is added to show event with highest number of deaths.\r\n\r\nGrid lines were removed. \r\n4.6 Percentage change in Events by Period\r\nNext chart is to be able to show the percentage change on the number of events based on reference year. First, a parameter called “Year Parameter” was created.\r\n\r\nA calculated field called “Value for Year Parameter” is created.\r\n\r\nA calculated field called “% Change vs selected Year” is created.\r\n\r\nTo be able to select the reference year on the chart, a parameter action “Change Year Parameter” is created via Worksheet–>Actions–>Add Action–>Change Parameter.\r\n\r\nThe “Year” measure is dragged to columns and “% change vs selected year” is dragged to rows.\r\n“Event Type” measure is dragged to both color and detail card, and “% change vs selected year” is dragged to label. The label is changed to show the percentage change at the line ends.\r\n\r\n\r\nThe animation of the chart move is changed via Format–> Animations, to 0.80 seconds. \r\nIn order to show the reference year point clearly, a new calculated field “Reference Point” is created. \r\n“Reference Point” measure is dragged to rows and dual axis is selected. The axis was also synchronized and header removed. \r\nA reference line was added to show the reference year as well. \r\nStandardize font to Tableau Book and font color of axis.\r\n4.7 Country Selection Bar\r\nTo create a country selection to be used in dashboard later on, the “Country” measure is dragged to columns and to the text mark card. \r\nThe font size was adjusted to size 12, borders were added via formatting and the chart resized.\r\nA “Country” Parameter was created as shown. \r\nA calculated field “Country Filter” is created. \r\nStandardize font to Tableau Book and font color of axis.\r\n4.8 Dashboard\r\nThe generic desktop size of 1366x768 was chosen for the dashboard size.\r\nTitle of dashboard is added. Title: “Conflicts in Country Events occurred vs Year”.\r\nA vertical box was dragged under the title, with pixel height adjusted to “2” and shaded black to create a line.\r\nThe “Map” sheet and “Percent Change” sheet under “Sheets” is dragged to the dashboard space. The “Country Bar” is dragged below the title.\r\nLegend for event type and number of Events are retained and repositioned below the “Country Bar”.\r\nDashboard actions were added via Dashboard–> Actions–> Add Action. First action to add was the “Change reference year” action choosing of reference year for the % change chart.\r\nSecond action to add was the “Country Parameter” action for choosing selected countries. \r\n“Text” is dragged to the bottom left of the dashboard to include source information: “Source from https://acleddata.com/#/dashboard Data from https://acleddata.com/data-export-tool/”\r\nAnother textbox is created at the bottom right of the dashboard to add the following text: “DataViz Makeover #3 Author: Desmond Lim”\r\nDashboard background color was changed via Dashboard–>Format–> Dashboard Shading \r\n5. Final Visualisation\r\n\r\n6. Main Observations\r\nIn 2020, most of the conflict events occurred Indonesia, Philippines and Myanmar. Laos was the lowest with 3 conflict events that occurred. \r\nSince 2016, “Violence against civilians” and “explosions/remote violence” has been dropping at an increasing rate. While “Riots”, “Protests” and “Strategic development” events has been on a general rising trend. \r\nThere is a huge spike in “Violence against Civilians” in 2016 from 2015 with an increase of 1025%. This is mainly due to events that occurred Calabarzon, Central Luzon and the National Capital region in the Philippines. \r\nThe high number of fatalities in 2017 due to battles in Bangsamoro Autonomous Region of the Philippines, contributing to 1513 deaths of the 2139 deaths in that year. \r\nThe fatalities from battles in Myanmar seemed to follow a four-year cycle, peaking at 2011, 2015 and 2019. \r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-21-dataviz-makeover-3/DataViz3 Pics/Final Viz.png",
    "last_modified": "2021-03-21T02:34:54+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "ISSS608 Visual Analytics and Applications: DataViz Makeover",
    "author": [
      {
        "name": "Desmond Lim",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1. Original Visualisation\r\n\r\n2. Critiques and Suggestions on Original Visualization\r\n2.1 Clarity\r\nCritique\r\nSuggestions\r\nThe country names on the y-axis are sorted differently on both charts. One is sorted alphabetically, while another is sorted on a descending order. It will be difficult for the reader to compare one country on the two charts.\r\nTo sort both charts similarly, either by value or alphabetically.\r\nIt is difficult to visualise the overall sentiment of the respondents through the first 100% stacked bar chart. We are only able to compare the extreme responses.\r\nTo use a divergent stacked bar chart to be able to visualise the positive and negative responses.\r\nThe accuracy of the percentage response is uncertain as there is no information on the sample size it is conducted on in each country.\r\nMake use of confidence interval chart to reflect the margin of error for the responses being given for each score.\r\nThe second chart can only show the response level to those who strongly agree to vaccination but unable show other responses\r\nTo enabling interactivity in the visualisation, i.e. the selecting of different responses will be reflected in the chart.\r\nThe charts does not show what was the question being asked to the public.\r\nTo show what was the question asked to the respondents.\r\n2.2 Aesthetics\r\nCritique\r\nSuggestions\r\nSince the axis title for both charts i.e. “% of Total Record” and “% Strongly agreed” is redundant as what the chart is trying to show has been clearly stated on the chart titles.\r\nTo ensure the chart title and axis title is meaningful and does not repeat.\r\nThe decimal place for the percentage value on the x-axis for the two charts are different. One is whole figure and another is showing to one decimal place.\r\nTo ensure decimal places shown chart values and axis values are standardized.\r\nThe name of the countries on y-axis are not capitalized i.e. first letter not in uppercase.\r\nTo edit the country name .\r\nFor the legend, only 1 and 5 is explained with “Strongly Agree” and “Strongly Disagree”. The rest are only in numbers.\r\nThe scale should be changed to explained the score representation. i.e. Strongly Agree, Agree, Neutral, Disagree, Strongly Disagree.\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\n3.2 Advantages of new visualisation\r\nUsing the above alternative visualisation, it retains the intent of the original charts to reflect a country’s response to the Covid-19 vaccination but made it more intuitive by highlighting the positive responses and negative responses. The survey question being asked is made available to show what was really asked to the public. The tooltip also allow the reader to have within row (country) comparison of the survey response.\r\nThe second chart is able to go in further detail the proportion of each score response and highlight the margin of error for each response.\r\nInteractivity is also introduced to allow the reader to filter amongst the different variables present in the data set and look at survey responses from other survey questions.\r\n4. Data Visualisation Steps\r\n4.1 Data Source\r\nThe data used was obtained from the Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. The datafiles contain responses from surveys of the general public from about symptoms, testing, self-isolation, social distancing and behaviour from 21 countries.\r\nFor the purpose of the DataViz makeover, the data from the following surveys were used:\r\nSurvey Code\r\nQuestion\r\nvac_1\r\nIf a Covid-19 vaccine were made available to me this week, I would definitely get it\r\nvac2_1\r\nI am worried about getting COVID19\r\nvac2_2\r\nI am worried about potential side effects of a COVID19 vaccine\r\nvac2_3\r\nI believe government health authorities in my country will provide me with an effective COVID19 vaccine\r\nvac2_6\r\nIf I do not get a COVID19 vaccine when it is available, I will regret it\r\nvac_3\r\nIf a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it\r\nAs only 14 countries were found with the above surveys, only data from these 14 countries were used. The 14 countries are:\r\nCountries\r\n\r\n\r\n\r\n\r\nAustralia\r\nFinland\r\nItaly\r\nNorway\r\nSweden\r\nCanada\r\nFrance\r\nJapan\r\nSingapore\r\nUnited- Kingdom\r\nDenmark\r\nGermany\r\nNetherlands\r\nSouth Korea\r\n\r\n4.2 Data Preparation in Excel\r\nThe “employment_status” variable was found to be classified differently in data from Denmark, Finland, Norway and Sweden. The employment status variable was split into 7 columns based on the original values as shown in below.\r\n\r\nTo obtain the “employment_status” variable, the column headers were changed to the 7 values as shown below\r\n\r\nThe following excel equation “=INDEX($CU\\(1:\\)DA$1,MATCH(”Yes“,CU2:DA2,0))” was used to obtain the employment status. The same method was applied to the Denmark, Finland, Norway and Sweden data set.\r\nThe scores for the different surveys were classified into “1 - Strongly Agree”, “2”, “3”, “4” and “5 -Strongly Disagree”. The string value of “Strongly Agree” and “Strongly Disagree” would affect data in Tableau later on, the values of “1 - Strongly Agree” and “5 -Strongly Disagree”, were replaced with “1” and “5” respectively for all the country data sets used.\r\n4.3 Data Preparation in Tableau\r\nTo prepare the data in Tableau, one of the country’s data set is first dragged into Tableau.\r\n\r\nThe data is then removed as shown. The “New Union” tab is dragged to the interface, generating a “Union” window. The dataset of all the countries are selected and dragged into the “Union” window as shown below. \r\nThe unrelated fields are selected and hidden, leaving behind the following fields.\r\nThe “Table Name” file is split to form a new column and the new field is renamed as “Country”.\r\nIn “Sheet 1”, the data type for the following is changed from “String” to “Number (Whole)”. \r\nConvert the measure “household_children” to dimension and group the number of children above 5 to “5 and more”. Renamed to “No. of Children”. \r\n4.4 Diverging Stacked Bar Chart\r\nCreating Calculated Field\r\nA new calculated field is created from the “Analysis” tab, with the “Create Calculated Field “option.\r\nA calculated field called “Number of Records” is created as shown. \r\nAnother calculated field “Total Count” is created similarly with the below formula. \r\nA new parameter “Survey” is created with settings shown below. The names of the survey were changed to the question of the survey. The parameter is set to “Show Parameter”. \r\nA calculated field named “Select Survey” is created. This field is to allow the switch of surveys between vac_1, vac2_1, vac2_2, vac2_3, vac2_6 and vac_3. The “Show Parameter” option was selected.\r\nThe survey score was edited to show to reflect 1 as “Strongly Agree”, 2 as “Agree”, 3 as “Neutral”, 4 as “Disagree” and 5 as “Strongly Disagree” by choosing to edit “Alias” on “Select Survey”.\r\nAs the value “1” refer to strongly agree, the score is sort in a descending order. \r\nA calculated field “Count Negative” is created as shown below to count the number of negative responses and half the neutral responses. \r\nA calculated field “Total Count Negative” is created. \r\nA calculated field “Percentage” is created.\r\nTo work out where the first position of the Gantt bar, a calculated field “Gantt Start” is created by dividing the negative of “Total Count Negative” by “Total Count”. \r\nA calculated field “Gantt Percent” is created to find the gantt position of the different responses by taking the previous response position and adding in the current response percentage.\r\nCreating Visualization\r\nTo create the chart, the “Country” measure is dragged to the Rows and “Gantt Percent” is dragged to Columns.\r\nThe “Select Survey” measure is dragged to filter. All values are selected other than the ”Null” values.\r\n“Select Survey” is dragged to the Detail card and “Gantt Percent” changed to calculate using “Select Survey”. \r\nThe Mark Type for the chart is changed to “Gantt Bar”, “Select Survey” is dragged to the Colour card and “Percentage” to the Size card.\r\nEdit the colours of the survey score.\r\nFormat the x-axis to show percentage values. Edit the axis for uniform axis range and title.\r\nIn a new sheet i.e. Respondents, drag “Country” to Rows and drag “Number of Records” onto “Text” card and edit text as shown. \r\nTo create a histogram chart as a tooltip. In another new sheet i.e. Histogram, by dragging “Country” and “Select Survey” to Columns and “Percentage” to Rows. \r\nRight click on “Percentage” and select compute using “Select Survey”. \r\n“Percentage” is dragged to the Label card and aligned as shown. \r\nCreate tooltip at the main sheet by clicking on “Tooltip” under the “Marks” card and linking “Respondents” and “Histogram” sheets and include percentage values. \r\nA reference line was added at zero to differentiate the positive and negative segments. \r\nChart title “Question: <Parameters.Survey>” added.\r\nStandardize font to Arial Black and font color of axis.\r\nThe completed visualisation for the diverging stacked bar chart will looked as below. \r\n4.5 Confidence Interval Chart\r\nNext, in order to visualise the uncertainty in the survey results i.e. margin of error. A confidence interval chart is use.\r\nFirst, a parameter “Survey Score” was created to allow which survey response score to be compared.\r\nCreating Calculate Fields\r\nCreate a calculated field, “Select Score”.\r\nAnother calculate field, “Prop Value” is created. This helps to determine the number of respondents choosing a certain score.\r\nNext calculated field to be created is “Prop”, to determine the percentage of respondents choosing a certain score.\r\nA “Standard Error” calculated field is created to obtained the standard error in confidence intervals.\r\nTwo calculated fields are created “Z Value 95%” and “Z Value 99%”. These are multiplier used to calculate the survey results are within 95%/99% of the possible responses. \r\nTwo more fields “Margin of Error 95%” and “Margin of Error 99%” are created. \r\nTwo calculated fields “Lower Limit 95%” and “Lower Limit 99%” for the lower limit for the 95% (99%) error bar. \r\nSimilarly, two calculated fields “Upper Limit 95%” and “Upper Limit 99%” to reflect the upper limit for the 95% (99%) error bar is created. \r\nCreating Visualization\r\nTo create the visualisation, the “Country” measure is dragged to the Rows and “Prop” is dragged to Columns.\r\nSimilar to the previous chart, the “Select Survey” measure is dragged to filter. All values are selected other than the ”Null” values.\r\nThe Mark Type for the chart is changed to “Circle”.\r\nDrag “Measure Values” to Columns, and right click on the Measure Values to create dual axis. Right click on the lower x-axis and choose “Synchronize Axis”.\r\nFilter the “Measure Names” by right-clicking it on the Filters card and retain “Lower Limit 95%”, “Lower Limit 99%”, “Upper Limit 95%” and “Upper Limit 99%”. \r\nUnder “Measure Value” in the Mark card, change the Mark type to “Lines” and drag “Measure Names” to “Path”.\r\nDrag “Measure Names” to “Color”, click on “Color” and edit the color palette to match the confidence intervals.\r\nHide the top header by unchecking “Show Header”.\r\nFormat the x-axis to show percentage values. Edit the axis for uniform axis range and title.\r\nThe chart tile “Confidence Level of Response for <Parameters.Survey Score>” is added to include show the survey score parameter.\r\nStandardize font to Arial Black and font color of axis.\r\nThe completed visualisation for the confidence interval chart will looked as below.\r\n4.6 Filters\r\nThe “Gender” dimensions is dragged to the Filter card and set to “Show Filter”. \r\nThe same were done to “Employment Status”, “Household Size” and “No. of Children”.\r\nAll the filters were set to apply to all worksheets using the same data source and a single value dropdown. \r\nThe “Age” measure was dragged to filter and set to filter by range. \r\n4.7 Dashboard\r\nTitle of dashboard is added. Title: “How about a Vaccine for you? Survey on Covid-19 Vaccine.”\r\nCommentary is added by dragging “Text” from “Objects” to the bottom of the title. Commentary states “Responses from the general public in 14 countries, given towards questions asked regarding the Covid-19 vaccine.”\r\nThe “Diverging stacked Bar” sheet and “CI Chart” sheet under “Sheets” is dragged to the dashboard space. All filters with survey score legend are retained.\r\n“Text” is dragged to the bottom left of the dashboard to include source information: “Source from: https://github.com/YouGov-Data/covid-19-tracker Data from:https://github.com/YouGov-Data/covid-19-tracker/tree/master/data”\r\nAnother textbox is created at the bottom right of the dashboard to add the following text: “DataViz Makeover #2 Author: Desmond Lim”\r\n5. Final Visualisation\r\n\r\n6. Main Observations\r\nMost countries show general positive sentiment towards taking the Covid-19 vaccine if made available, as shown in the chart. i.e. Positive sentiments higher than negative sentiments. Only France out of the 14 countries shows a negative sentiment response to the vaccine. \r\nFor VAC_1, there is a larger margin of error responses for Netherlands, Japan and South Korea compared to the other countries. This is due to the smaller sample size of respondents from the three countries. Netherlands with 10,899, Japan with 10,887 respondents and South Korea with 9,807 respondents. The next lowest country is Canada with 18,780 respondents, which is almost two times South Korea’s. \r\nComparing VAC_1 with VAC_3, where VAC_3 is about willing to take the vaccine when made available 1 year later, there is a significant increase from the public response from various countries where the public strongly agrees with the statement, i.e. France from 21.9% to 35.3%, Singapore from 18.1% to 27.4%. This shows a portion of the public still doubts the efficacy of the Covid-19 vaccine at this stage. \r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-19-dataviz-makeover-2/DataViz 2 Pics/Final Viz.png",
    "last_modified": "2021-02-19T07:00:53+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "ISSS608 Visual Analytics and Applications: DataViz Makeover",
    "author": [
      {
        "name": "Desmond Lim",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1. Critiques and Suggestions on Current Visualisation\r\nClarity\r\nCritiques\r\nSuggestions\r\n1) Information in the lead-in paragraph could not be visualized/interpreted from the chart. For example, it stated the share of labour force aged 25 to 54 declined from 75% to 67%. That could not be interpreted from the chart, as the population are grouped in 5-year brackets.\r\nThe dashboard title and lead-in to be able to relate and provide an intuitive understanding to the chart visualisation.\r\n2) The visualisation only depicts the comparison statistics from 2009 and 2019. It lacks the information on the changes between 2009 and 2019.\r\nThe chart visualisation will incorporate the data from 2009 to 2019 to gain more insights to the change in resident labour population over the years.\r\n3) It is not clear whether x-axis labels i.e. 15-19,is categorical or continuous. There is no x-axis title to explain the axis value. Lack of a y-axis and gridlines to provide a gauge for the values.\r\nTo ensure accurate x and y-axis labels with axis title to describe the axis.\r\n4) The median age reference lines used might not be accurately reflecting the chart as the x-axis of “40-44” might be a categorical data.\r\nTo use other statistical values to provide insights to the labour force participation.\r\nAesthetics\r\nCritiques\r\nSuggestions\r\n1) The x-axis labels are not aligned to the tick marks but in between the tick marks.\r\nIncorporate proper axis labelling and aligning.\r\n2) Poor colour coding. The colour of the “June 2009” line is too close to the background colour.\r\nProper colour but non-excessive colour coding to highlight necessary information.\r\n3) Poor spacing between the chart axis and the table.\r\nInstead of using a table, proper axis will be in place to show the values in the visualisation\r\n2. Proposed Visualisation Design\r\n Using the above alternative visualisation, it retains the intent of the lead in paragraph which is to be able to compare the labour force participation rate directly with actual resident population in the workforce through a dual axis visualisation.\r\nIt also follows the re-grouping of the age groups into in the lead-in paragraph by classifying into 3 groups “Age 15-24”, “Age 25-54” and “Age 55 & over”.\r\n3. Tableau Visualisation Steps\r\nData Preparation in Excel\r\nS/N\r\nArea\r\nAction\r\n1\r\nRemove irrelevant data\r\nRemoved one row of data under “Total” from excel data file “mrsd_2019LabourForce_T7”.\r\n2\r\nExtract relevant data\r\nExtracted fives rows of data under “15 -24”, “25 -54”, “55 -65” and “65 & over” from excel data file “mrsd_2019LabourForce_T5”.\r\nChart Preparation in Tableau\r\nS/N\r\nArea\r\nAction\r\n1\r\nImport data (Excel) into Tableau\r\n- Connection was created with “mrsd_2019LabourForce_T7”. - Using sheets “T7_T” from the data, a column containing “null” values was hidden. - The columns for the individual years, were highlighted and pivoted to transpose the data.  - The new column was renamed and data type changed from “String” to “Year”.  - “Age (Years)” renamed to “Age Group (Years)”  - Another data source “mrsd_2019LabourForce_T5” was added.  - Same steps were taken to transpose the “Year” columns and to change data type.\r\n2\r\nGrouping the Age Groups\r\n- In Sheet 1, the “Age Group (Years)” table is further grouped through the “Create”, “Group” function as shown. - The “Age Group” was further grouped into 4 main groups namely “15 -24”, “25 -54”, “55 -65” and “65 & over”.  - Creating a new Table “Age Group (Years) II”.\r\n3\r\nCreating first chart\r\n- The first chart shows the resident labour force in each of the age group. - The “Year” measure was dragged to column and the “Population” measure was dragged to Rows. The mark was change to “Line”. - To view the labour participation rate, “Quick Table Calculation” was used to calculate “Percent of Total” and computed using “Table (down)”.- “Sum(Population)” was Ctrl+ Drag to Label. “Line Ends” option was selected.- The y-axis was renamed to “Labour Force by Age Group”  - “Sheet 1” was renamed as “Workforce”.\r\n4\r\nCreating second chart\r\n- The first chart shows the resident labour force participation rate in each of the age group. - A new calculation field “LFPR%” was created with the formula “[LFPR]/100”. This is in order to display the data in percentage format. - The “Year” measure was dragged to column and the “LFPR%” measure was dragged to Rows. - “LFPR%” was dragged to Label. “Line Ends” option was selected. - The y-axis was renamed to “Labour Force Participation Rate”. Y-axis formatted to show percentage. - “Sheet 2” was renamed as “LFPR”.\r\n5\r\nCreating of dashboard And formatting\r\n- Drag “Workforce” and “LFPR” sheet into dashboard. - Drag Text bar to create dashboard title and data source. - Axis of both charts were edited for them to align.\r\n4. Final Visualisation\r\n\r\n5. Insights\r\nThe labour force participation rate for the elderly (55 years old and above) has increased significantly over the years. From 2009 to 2019, the LFPR for the 55 to 64 age group increased from 60.65 to 69.9% and 17.2% to 28.7% for the 64 and above age group. Correspondent changes were seen in the elderly proportion in the labour force with an increase in about 5% for the 55 to 64 age group and about 4% in the 65 and above age group.\r\n\r\nAlthough the labour force participation rate for the main workforce (25-54 years) has increased to 88.3% in 2019 from 84.5% in 2009. A significant drop was seen in the age group’s proportion in the labour force from 75.35% to 67.44%. This was due to the aging of the main force and transitioning into the elderly work force (55 and over) over the past 10 years.\r\n 3. The proportion of the youth (15-24 years) in the labour force is stable with a drop of about 1% from 8.97% (Year 2009) to 7.95% (Year 2019). However, there is an increase of labour force participation rate from 35.6% to 38.3%.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-27-dataviz-makeover-1/DataViz1 Pics/Dataviz1 Pic 16 Dashboard.png",
    "last_modified": "2021-01-28T02:44:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Desmond Lim",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-06T18:42:12+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Idea",
    "description": "Welcome to our new blog, Idea. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Dasimon Lim",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:52+08:00",
    "input_file": {}
  }
]
